aurelj/stm32f4xx-hal/src/serial.rs
use core::fmt;
use core::marker::PhantomData;
use core::ptr;

use embedded_hal::serial;
use embedded_hal::prelude::*;
use nb::block;

#[cfg(any(
    feature = "stm32f0",
    feature = "stm32f1",
    feature = "stm32f401",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f410",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
use crate::stm32::{RCC, USART1, USART2};

#[cfg(any(
    feature = "stm32f0",
    feature = "stm32f1",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
use crate::stm32::USART3;

#[cfg(feature = "stm32f0")]
use crate::stm32::USART4;

#[cfg(any(
    feature = "stm32f0x0",
    feature = "stm32f0x1",
    feature = "stm32f0x8"
))]
use crate::stm32::USART5;

#[cfg(any(
    feature = "stm32f100",
    feature = "stm32f101",
    feature = "stm32f103",
    feature = "stm32f105",
    feature = "stm32f107",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
use crate::stm32::{UART4, UART5};

#[cfg(any(
    feature = "stm32f0x0",
    feature = "stm32f0x1",
    feature = "stm32f0x8",
    feature = "stm32f401",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f410",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
use crate::stm32::USART6;

#[cfg(any(
    feature = "stm32f0x1",
    feature = "stm32f0x8"
))]
use crate::stm32::{USART7, USART8};

#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f469",
    feature = "stm32f479"
))]
use crate::stm32::{UART7, UART8};

#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423"
))]
use crate::stm32::{UART9, UART10};


#[cfg(any(
    feature = "stm32f0",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
use crate::gpio::gpioa::{PA0, PA1};
#[cfg(any(
    feature = "stm32f0",
    feature = "stm32f1",
    feature = "stm32f401",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f410",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
use crate::gpio::gpioa::{PA2, PA3, PA9, PA10};
#[cfg(any(
    feature = "stm32f0x0",
    feature = "stm32f0x1",
    feature = "stm32f0x8"
))]
use crate::gpio::gpioa::{PA4, PA5};
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423"
))]
use crate::gpio::gpioa::{PA8};
#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f410",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423"
))]
use crate::gpio::gpioa::{PA11, PA12};
#[cfg(any(
    feature = "stm32f0"
))]
use crate::gpio::gpioa::{PA14};
#[cfg(any(
    feature = "stm32f0",
    feature = "stm32f410",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423"
))]
use crate::gpio::gpioa::{PA15};

#[cfg(any(
    feature = "stm32f0x0",
    feature = "stm32f0x1",
    feature = "stm32f0x8",
    feature = "stm32f410",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423"
))]
use crate::gpio::gpiob::{PB3};
#[cfg(any(
    feature = "stm32f0x0",
    feature = "stm32f0x1",
    feature = "stm32f0x8",
    feature = "stm32f413",
    feature = "stm32f423"
))]
use crate::gpio::gpiob::{PB4};
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423"
))]
use crate::gpio::gpiob::{PB5};
#[cfg(any(
    feature = "stm32f0",
    feature = "stm32f1",
    feature = "stm32f401",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f410",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
use crate::gpio::gpiob::{PB6, PB7};
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423"
))]
use crate::gpio::gpiob::{PB8, PB9};
#[cfg(any(
    feature = "stm32f0",
    feature = "stm32f1",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
use crate::gpio::gpiob::{PB10, PB11};
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423"
))]
use crate::gpio::gpiob::{PB12, PB13};

#[cfg(any(
    feature = "stm32f0x0",
    feature = "stm32f0x1",
    feature = "stm32f0x8"
))]
use crate::gpio::gpioc::{PC0, PC1};
#[cfg(any(
    feature = "stm32f0x1",
    feature = "stm32f0x8"
))]
use crate::gpio::gpioc::{PC2, PC3};
#[cfg(any(
    feature = "stm32f0"
))]
use crate::gpio::gpioc::{PC4};
#[cfg(any(
    feature = "stm32f0",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f446"
))]
use crate::gpio::gpioc::{PC5};
#[cfg(any(
    feature = "stm32f0x1",
    feature = "stm32f0x8",
    feature = "stm32f401",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f410",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
use crate::gpio::gpioc::{PC6, PC7};
#[cfg(any(
    feature = "stm32f0x1",
    feature = "stm32f0x8"
))]
use crate::gpio::gpioc::{PC8, PC9};
#[cfg(any(
    feature = "stm32f0",
    feature = "stm32f100",
    feature = "stm32f101",
    feature = "stm32f103",
    feature = "stm32f105",
    feature = "stm32f107",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
use crate::gpio::gpioc::{PC10, PC11};
#[cfg(any(
    feature = "stm32f0x0",
    feature = "stm32f0x1",
    feature = "stm32f0x8",
    feature = "stm32f100",
    feature = "stm32f101",
    feature = "stm32f103",
    feature = "stm32f105",
    feature = "stm32f107",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
use crate::gpio::gpioc::PC12;

#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423"
))]
use crate::gpio::gpiod::{PD0, PD1};
#[cfg(any(
    feature = "stm32f0x0",
    feature = "stm32f0x1",
    feature = "stm32f0x8",
    feature = "stm32f100",
    feature = "stm32f101",
    feature = "stm32f103",
    feature = "stm32f105",
    feature = "stm32f107",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
use crate::gpio::gpiod::PD2;
#[cfg(any(
    feature = "stm32f0x1",
    feature = "stm32f0x2",
    feature = "stm32f0x8",
    feature = "stm32f100",
    feature = "stm32f101",
    feature = "stm32f103",
    feature = "stm32f105",
    feature = "stm32f107",
    feature = "stm32f401",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
use crate::gpio::gpiod::{PD5, PD6};
#[cfg(any(
    feature = "stm32f0x1",
    feature = "stm32f0x2",
    feature = "stm32f0x8",
    feature = "stm32f100",
    feature = "stm32f101",
    feature = "stm32f103",
    feature = "stm32f105",
    feature = "stm32f107",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
use crate::gpio::gpiod::{PD8, PD9};
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423"
))]
use crate::gpio::gpiod::PD10;
#[cfg(any(
    feature = "stm32f0x1",
    feature = "stm32f0x8"
))]
use crate::gpio::gpiod::{PD13};
#[cfg(any(
    feature = "stm32f0x1",
    feature = "stm32f0x8",
    feature = "stm32f413",
    feature = "stm32f423"
))]
use crate::gpio::gpiod::{PD14};
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423"
))]
use crate::gpio::gpiod::{PD15};

#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f469",
    feature = "stm32f479"
))]
use crate::gpio::gpioe::{PE0, PE1};
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423"
))]
use crate::gpio::gpioe::{PE2, PE3};
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
use crate::gpio::gpioe::{PE7};
#[cfg(any(
    feature = "stm32f0x1",
    feature = "stm32f0x8",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
use crate::gpio::gpioe::{PE8};
#[cfg(any(
    feature = "stm32f0x1",
    feature = "stm32f0x8"
))]
use crate::gpio::gpioe::{PE9, PE10, PE11};

#[cfg(any(
    feature = "stm32f0x1",
    feature = "stm32f0x8"
))]
use crate::gpio::gpiof::{PF2, PF3};
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f469",
    feature = "stm32f479"
))]
use crate::gpio::gpiof::{PF6, PF7};
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423"
))]
use crate::gpio::gpiof::{PF8};
#[cfg(any(
    feature = "stm32f0x1",
    feature = "stm32f0x8",
    feature = "stm32f413",
    feature = "stm32f423"
))]
use crate::gpio::gpiof::{PF9};
#[cfg(any(
    feature = "stm32f0x1",
    feature = "stm32f0x8"
))]
use crate::gpio::gpiof::{PF10};

#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423"
))]
use crate::gpio::gpiog::{PG0, PG1};
#[cfg(any(
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
use crate::gpio::gpiog::{PG14, PG9};
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423"
))]
use crate::gpio::gpiog::{PG11, PG12};

use crate::gpio::Alternate;
#[cfg(feature = "stm32f0")]
use crate::gpio::{AF0, AF1, AF4};
#[cfg(any(
    feature = "stm32f0x0",
    feature = "stm32f0x1",
    feature = "stm32f0x8"
))]
use crate::gpio::{AF2, AF5};
#[cfg(feature = "stm32f1")]
use crate::gpio::{Input, Floating, PushPull};
#[cfg(feature = "stm32f4")]
use crate::gpio::{AF7, AF8};
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423"
))]
use crate::gpio::AF11;
use crate::rcc::Clocks;

