aurelj/stm32f4xx-hal/src/serial.rs
#[cfg(any(
    feature = "stm32f0x0",
    feature = "stm32f0x1",
    feature = "stm32f0x8"
))]
impl PinTx<USART5> for NoTx {}
#[cfg(any(
    feature = "stm32f100",
    feature = "stm32f101",
    feature = "stm32f103",
    feature = "stm32f105",
    feature = "stm32f107",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinTx<UART5> for NoTx {}
#[cfg(any(
    feature = "stm32f0x0",
    feature = "stm32f0x1",
    feature = "stm32f0x8"
))]
impl PinRx<USART5> for NoRx {}
#[cfg(any(
    feature = "stm32f100",
    feature = "stm32f101",
    feature = "stm32f103",
    feature = "stm32f105",
    feature = "stm32f107",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinRx<UART5> for NoRx {}
#[cfg(any(
    feature = "stm32f0x0",
    feature = "stm32f0x1",
    feature = "stm32f0x8"
))]
impl PinTx<USART5> for PB3<Alternate<AF4>> {}
#[cfg(any(
    feature = "stm32f0x0",
    feature = "stm32f0x1",
    feature = "stm32f0x8"
))]
impl PinRx<USART5> for PB4<Alternate<AF4>> {}
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423"
))]
impl PinTx<UART5> for PB6<Alternate<AF11>> {}
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423"
))]
impl PinRx<UART5> for PB5<Alternate<AF11>> {}
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423"
))]
impl PinTx<UART5> for PB9<Alternate<AF11>> {}
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423"
))]
impl PinRx<UART5> for PB8<Alternate<AF11>> {}
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423"
))]
impl PinTx<UART5> for PB13<Alternate<AF11>> {}
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423"
))]
impl PinRx<UART5> for PB12<Alternate<AF11>> {}
#[cfg(any(
    feature = "stm32f0x0",
    feature = "stm32f0x1",
    feature = "stm32f0x8"
))]
impl PinTx<USART5> for PC12<Alternate<AF2>> {}
#[cfg(any(
    feature = "stm32f100",
    feature = "stm32f101",
    feature = "stm32f103",
    feature = "stm32f105",
    feature = "stm32f107"
))]
impl PinTx<UART5> for PC12<Alternate<PushPull>> {}
#[cfg(any(
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinTx<UART5> for PC12<Alternate<AF8>> {}
#[cfg(any(
    feature = "stm32f0x0",
    feature = "stm32f0x1",
    feature = "stm32f0x8"
))]
impl PinRx<USART5> for PD2<Alternate<AF2>> {}
#[cfg(any(
    feature = "stm32f100",
    feature = "stm32f101",
    feature = "stm32f103",
    feature = "stm32f105",
    feature = "stm32f107"
))]
impl PinRx<UART5> for PD2<Input<Floating>> {}
#[cfg(any(
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinRx<UART5> for PD2<Alternate<AF8>> {}
#[cfg(any(
    feature = "stm32f446"
))]
impl PinTx<UART5> for PE8<Alternate<AF8>> {}
#[cfg(any(
    feature = "stm32f446"
))]
impl PinRx<UART5> for PE7<Alternate<AF8>> {}
#[cfg(any(
    feature = "stm32f0x1",
    feature = "stm32f0x8"
))]
impl PinTx<USART5> for PE10<Alternate<AF1>> {}
#[cfg(any(
    feature = "stm32f0x1",
    feature = "stm32f0x8"
))]
impl PinRx<USART5> for PE11<Alternate<AF1>> {}

#[cfg(any(
    feature = "stm32f0x0",
    feature = "stm32f0x1",
    feature = "stm32f0x8",
    feature = "stm32f401",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f410",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinTx<USART6> for NoTx {}
#[cfg(any(
    feature = "stm32f0x0",
    feature = "stm32f0x1",
    feature = "stm32f0x8",
    feature = "stm32f401",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f410",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinRx<USART6> for NoRx {}
#[cfg(any(
    feature = "stm32f0x0",
    feature = "stm32f0x1",
    feature = "stm32f0x8"
))]
impl PinTx<USART6> for PA4<Alternate<AF5>> {}
#[cfg(any(
    feature = "stm32f0x0",
    feature = "stm32f0x1",
    feature = "stm32f0x8"
))]
impl PinTx<USART6> for PA5<Alternate<AF5>> {}
#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f410",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423"
))]
impl PinTx<USART6> for PA11<Alternate<AF8>> {}
#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f410",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423"
))]
impl PinRx<USART6> for PA12<Alternate<AF8>> {}
#[cfg(any(
    feature = "stm32f0x0",
    feature = "stm32f0x1",
    feature = "stm32f0x8"
))]
impl PinTx<USART6> for PC0<Alternate<AF2>> {}
#[cfg(any(
    feature = "stm32f0x0",
    feature = "stm32f0x1",
    feature = "stm32f0x8"
))]
impl PinTx<USART6> for PC1<Alternate<AF2>> {}
#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f410",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinTx<USART6> for PC6<Alternate<AF8>> {}
#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f410",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinRx<USART6> for PC7<Alternate<AF8>> {}
#[cfg(any(
    feature = "stm32f0x1",
    feature = "stm32f0x8"
))]
impl PinTx<USART6> for PF9<Alternate<AF1>> {}
#[cfg(any(
    feature = "stm32f0x1",
    feature = "stm32f0x8"
))]
impl PinTx<USART6> for PF10<Alternate<AF1>> {}
#[cfg(any(
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinTx<USART6> for PG14<Alternate<AF8>> {}
#[cfg(any(
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinRx<USART6> for PG9<Alternate<AF8>> {}

#[cfg(any(
    feature = "stm32f0x1",
    feature = "stm32f0x8"
))]
impl PinTx<USART7> for NoTx {}
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinTx<UART7> for NoTx {}
#[cfg(any(
    feature = "stm32f0x1",
    feature = "stm32f0x8"
))]
impl PinRx<USART7> for NoRx {}
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinRx<UART7> for NoRx {}
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423"
))]
impl PinTx<UART7> for PA15<Alternate<AF8>> {}
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423"
))]
impl PinRx<UART7> for PA8<Alternate<AF8>> {}
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423"
))]
impl PinTx<UART7> for PB4<Alternate<AF8>> {}
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423"
))]
impl PinRx<UART7> for PB3<Alternate<AF8>> {}
#[cfg(any(
    feature = "stm32f0x1",
    feature = "stm32f0x8"
))]
impl PinTx<USART7> for PC0<Alternate<AF1>> {}
#[cfg(any(
    feature = "stm32f0x1",
    feature = "stm32f0x8"
))]
impl PinRx<USART7> for PC1<Alternate<AF1>> {}
#[cfg(any(
    feature = "stm32f0x1",
    feature = "stm32f0x8"
))]
impl PinTx<USART7> for PC6<Alternate<AF1>> {}
#[cfg(any(
    feature = "stm32f0x1",
    feature = "stm32f0x8"
))]
impl PinRx<USART7> for PC7<Alternate<AF1>> {}
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinTx<UART7> for PE8<Alternate<AF8>> {}
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinRx<UART7> for PE7<Alternate<AF8>> {}
#[cfg(any(
    feature = "stm32f0x1",
    feature = "stm32f0x8"
))]
impl PinTx<USART7> for PF2<Alternate<AF1>> {}
#[cfg(any(
    feature = "stm32f0x1",
    feature = "stm32f0x8"
))]
impl PinRx<USART7> for PF3<Alternate<AF1>> {}
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinTx<UART7> for PF7<Alternate<AF8>> {}
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinRx<UART7> for PF6<Alternate<AF8>> {}

#[cfg(any(
    feature = "stm32f0x1",
    feature = "stm32f0x8"
))]
impl PinTx<USART8> for NoTx {}
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinTx<UART8> for NoTx {}
#[cfg(any(
    feature = "stm32f0x1",
    feature = "stm32f0x8"
))]
impl PinRx<USART8> for NoRx {}
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinRx<UART8> for NoRx {}
#[cfg(any(
    feature = "stm32f0x1",
    feature = "stm32f0x8"
))]
impl PinTx<USART8> for PC2<Alternate<AF2>> {}
#[cfg(any(
    feature = "stm32f0x1",
    feature = "stm32f0x8"
))]
impl PinRx<USART8> for PC3<Alternate<AF2>> {}
#[cfg(any(
    feature = "stm32f0x1",
    feature = "stm32f0x8"
))]
impl PinTx<USART8> for PC8<Alternate<AF1>> {}
#[cfg(any(
    feature = "stm32f0x1",
    feature = "stm32f0x8"
))]
impl PinRx<USART8> for PC9<Alternate<AF1>> {}
#[cfg(any(
    feature = "stm32f0x1",
    feature = "stm32f0x8"
))]
impl PinTx<USART8> for PD13<Alternate<AF0>> {}
#[cfg(any(
    feature = "stm32f0x1",
    feature = "stm32f0x8"
))]
impl PinRx<USART8> for PD14<Alternate<AF0>> {}
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinTx<UART8> for PE1<Alternate<AF8>> {}
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinRx<UART8> for PE0<Alternate<AF8>> {}
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423"
))]
impl PinTx<UART8> for PF9<Alternate<AF8>> {}
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423"
))]
impl PinRx<UART8> for PF8<Alternate<AF8>> {}

#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423"
))]
impl PinTx<UART9> for NoTx {}
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423"
))]
impl PinRx<UART9> for NoRx {}
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423"
))]
impl PinTx<UART9> for PD15<Alternate<AF11>> {}
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423"
))]
impl PinRx<UART9> for PD14<Alternate<AF11>> {}
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423"
))]
impl PinTx<UART9> for PG1<Alternate<AF11>> {}
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423"
))]
impl PinRx<UART9> for PG0<Alternate<AF11>> {}

#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423"
))]
impl PinTx<UART10> for NoTx {}
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423"
))]
impl PinRx<UART10> for NoRx {}
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423"
))]
impl PinTx<UART10> for PE3<Alternate<AF11>> {}
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423"
))]
impl PinRx<UART10> for PE2<Alternate<AF11>> {}
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423"
))]
impl PinTx<UART10> for PG12<Alternate<AF11>> {}
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423"
))]
impl PinRx<UART10> for PG11<Alternate<AF11>> {}


/// Serial abstraction
pub struct Serial<USART, PINS> {
    usart: USART,
    pins: PINS,
}

