aurelj/stm32f4xx-hal/src/serial.rs
                    if sr.tc().bit_is_set() {
                        Ok(())
                    } else {
                        Err(nb::Error::WouldBlock)
                    }
                }

                fn write(&mut self, byte: u8) -> nb::Result<(), Self::Error> {
                    // NOTE(unsafe) atomic read with no side effects
                    let sr = unsafe { (*$USARTX::ptr()).$sr.read() };

                    if sr.txe().bit_is_set() {
                        // NOTE(unsafe) atomic write to stateless register
                        // NOTE(write_volatile) 8-bit write that's not possible through the svd2rust API
                        unsafe { ptr::write_volatile(&(*$USARTX::ptr()).$tdr as *const _ as *mut _, byte) }
                        Ok(())
                    } else {
                        Err(nb::Error::WouldBlock)
                    }
                }
            }
        )+
    }
}

macro_rules! halUsart {
    ($(
        $USARTX:ident: ($usartX:ident, $apbXenr:ident, $usartXen:ident, $pclkX:ident, $sr:ident, $rdr:ident, $tdr:ident, $nf:ident),
    )+) => {
        $(
        impl<PINS> Serial<$USARTX, PINS> {
            fn config_stop(self, config: config::Config) -> Self {
                use crate::stm32::usart1::cr2::STOPW;
                use self::config::*;

                self.usart.cr2.write(|w| {
                    w.stop().variant(match config.stopbits {
                        StopBits::STOP0P5 => STOPW::STOP0P5,
                        StopBits::STOP1 => STOPW::STOP1,
                        StopBits::STOP1P5 => STOPW::STOP1P5,
                        StopBits::STOP2 => STOPW::STOP2,
                    })
                });
                self
            }
        }
        )+

        halUsartImpl! {
            $( $USARTX: ($usartX, $apbXenr, $usartXen, $pclkX, $sr, $rdr, $tdr, $nf), )+
        }
    }
}

#[cfg(any(
    feature = "stm32f100",
    feature = "stm32f101",
    feature = "stm32f103",
    feature = "stm32f105",
    feature = "stm32f107",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
macro_rules! halUart {
    ($(
        $USARTX:ident: ($usartX:ident, $apbXenr:ident, $usartXen:ident, $pclkX:ident, $sr:ident, $rdr:ident, $tdr:ident, $nf:ident),
    )+) => {
        $(
        impl<PINS> Serial<$USARTX, PINS> {
            fn config_stop(self, config: config::Config) -> Self {
                use crate::stm32::uart4::cr2::STOPW;
                use self::config::*;

                self.usart.cr2.write(|w| {
                    w.stop().variant(match config.stopbits {
                        StopBits::STOP0P5 => STOPW::STOP1,
                        StopBits::STOP1 => STOPW::STOP1,
                        StopBits::STOP1P5 => STOPW::STOP2,
                        StopBits::STOP2 => STOPW::STOP2,
                    })
                });
                self
            }
        }
        )+

        halUsartImpl! {
            $( $USARTX: ($usartX, $apbXenr, $usartXen, $pclkX, $sr, $rdr, $tdr, $nf), )+
        }
    }
}

#[cfg(feature = "stm32f0")]
halUsart! {
    USART1: (usart1, apb2enr, usart1en, pclk2, isr, rdr, tdr, nf),
    USART2: (usart2, apb1enr, usart2en, pclk1, isr, rdr, tdr, nf),
}

#[cfg(feature = "stm32f1")]
halUsart! {
    USART1: (usart1, apb2enr, usart1en, pclk2, sr, dr, dr, ne),
    USART2: (usart2, apb1enr, usart2en, pclk1, sr, dr, dr, ne),
}

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f410",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
halUsart! {
    USART1: (usart1, apb2enr, usart1en, pclk2, sr, dr, dr, nf),
    USART2: (usart2, apb1enr, usart2en, pclk1, sr, dr, dr, nf),
    USART6: (usart6, apb2enr, usart6en, pclk2, sr, dr, dr, nf),
}

#[cfg(feature = "stm32f0")]
halUsart! {
    USART3: (usart3, apb1enr, usart3en, pclk1, isr, rdr, tdr, nf),
}

#[cfg(feature = "stm32f1")]
halUsart! {
    USART3: (usart3, apb1enr, usart3en, pclk1, sr, dr, dr, ne),
}

#[cfg(any(
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
halUsart! {
    USART3: (usart3, apb1enr, usart3en, pclk1, sr, dr, dr, nf),
}

#[cfg(feature = "stm32f0")]
halUsart! {
    USART4: (usart4, apb1enr, usart4en, pclk1, isr, rdr, tdr, nf),
}

#[cfg(any(
    feature = "stm32f0x0",
    feature = "stm32f0x1",
    feature = "stm32f0x8"
))]
halUsart! {
    USART5: (usart5, apb1enr, usart5en, pclk1, isr, rdr, tdr, nf),
}

#[cfg(any(
    feature = "stm32f100",
    feature = "stm32f101",
    feature = "stm32f103",
    feature = "stm32f105",
    feature = "stm32f107"
))]
halUart! {
    UART4: (uart4, apb1enr, uart4en, pclk1, sr, dr, dr, ne),
    UART5: (uart5, apb1enr, uart5en, pclk1, sr, dr, dr, ne),
}

#[cfg(any(
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
halUart! {
    UART4: (uart4, apb1enr, uart4en, pclk1, sr, dr, dr, nf),
    UART5: (uart5, apb1enr, uart5en, pclk1, sr, dr, dr, nf),
}

#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423"
))]
halUsart! {
    UART4: (uart4, apb1enr, uart4en, pclk1, sr, dr, dr, nf),
    UART5: (uart5, apb1enr, uart5en, pclk1, sr, dr, dr, nf),
}

#[cfg(any(
    feature = "stm32f0x0",
    feature = "stm32f0x1",
    feature = "stm32f0x8"
))]
halUsart! {
    USART6: (usart6, apb2enr, usart6en, pclk2, isr, rdr, tdr, nf),
}

#[cfg(any(
    feature = "stm32f0x1",
    feature = "stm32f0x8"
))]
halUsart! {
    USART7: (usart7, apb2enr, usart7en, pclk2, isr, rdr, tdr, nf),
    USART8: (usart8, apb2enr, usart8en, pclk2, isr, rdr, tdr, nf),
}

#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f469",
    feature = "stm32f479"
))]
halUsart! {
    UART7: (uart7, apb1enr, uart7en, pclk1, sr, dr, dr, nf),
    UART8: (uart8, apb1enr, uart8en, pclk1, sr, dr, dr, nf),
}

#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423"
))]
halUsart! {
    UART9: (uart9, apb2enr, uart9en, pclk2, sr, dr, dr, nf),
    UART10: (uart10, apb2enr, uart10en, pclk2, sr, dr, dr, nf),
}

impl<USART> fmt::Write for Tx<USART>
where
    Tx<USART>: serial::Write<u8>,
{
    fn write_str(&mut self, s: &str) -> fmt::Result {
        let _ = s
            .as_bytes()
            .iter()
            .map(|c| block!(self.write(*c)))
            .last();
        Ok(())
    }
}
